       SD  SORT-ALU.
       01  srt-reg.
           03 srt-legajo pic 9(5).
           03 srt-materia pic x(2).
           03 srt-cuatri pic 9(2).
           03 srt-curso pic x.
           03 srt-nota pic 99.
